jmeter-tests.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1488376203000</longProp>
        <longProp name="ThreadGroup.end_time">1488376203000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&#xd;
&lt;epcis:EPCISDocument xmlns:epcis=&quot;urn:epcglobal:epcis:xsd:1&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; creationDate=&quot;2008-03-06T11:42:15.016+01:00&quot; schemaVersion=&quot;1.0&quot; xmlns:myNs=&quot;http://my.unique.namespace&quot;&gt;&#xd;
    &lt;EPCISBody&gt;&#xd;
        &lt;EventList&gt;&#xd;
            &lt;ObjectEvent&gt;&#xd;
                &lt;eventTime&gt;2009-08-21T13:28:17Z&lt;/eventTime&gt;&#xd;
                &lt;eventTimeZoneOffset&gt;+00:00&lt;/eventTimeZoneOffset&gt;&#xd;
                &lt;epcList&gt;&#xd;
                    &lt;epc&gt;urn:epc:id:sgtin:0057000.123780.7788&lt;/epc&gt;&#xd;
                &lt;/epcList&gt;&#xd;
                &lt;action&gt;ADD&lt;/action&gt;&#xd;
                &lt;bizStep&gt;urn:fosstrak:demo:bizstep:fmcg:production&lt;/bizStep&gt;&#xd;
                &lt;disposition&gt;urn:fosstrak:demo:disp:fmcg:pendingQA&lt;/disposition&gt;&#xd;
                &lt;readPoint&gt;&#xd;
                    &lt;id&gt;urn:fosstrak:demo:fmcg:ssl:0037000.00729.210,432&lt;/id&gt;&#xd;
                &lt;/readPoint&gt;&#xd;
                &lt;bizLocation&gt;&#xd;
                    &lt;id&gt;urn:fosstrak:demo:fmcg:ssl:0037000.00729.210&lt;/id&gt;&#xd;
                &lt;/bizLocation&gt;&#xd;
            &lt;/ObjectEvent&gt;&#xd;
        &lt;/EventList&gt;&#xd;
    &lt;/EPCISBody&gt;&#xd;
&lt;/epcis:EPCISDocument&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">13592</stringProp>
          <stringProp name="HTTPSampler.path">EpcisCapture/Capture</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">text/xml</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>